from django.http import HttpResponse


def index(request):
    return HttpResponse("""
        <h1>Одеса</h1>
        <h2>Головна</h2>
        <p>Ласкаво просимо на сайт про Одесу!</p>
        <p>Тут ви знайдете новини, цікаві факти,
        історію міста та контакти міських служб.</p>
    """)
def news(request):
    return HttpResponse("""
        <h1>Новини Одеси</h1>
        <p>Це розділ новин міста.</p>
        <p>Тут будуть публікуватися міські новини та оголошення.</p>
    """)
def management(request):
    return HttpResponse("""
        <h1>Керівництво міста Одеси</h1>
        <p>Цей розділ присвячений керівництву міста.</p>
        <p>Тут буде інформація про посадових осіб
        та їхні обов’язки.</p>
    """)
def facts(request):
    return HttpResponse("""
        <h1>Факти про Одесу</h1>
        <ul>
            <li>Одеса розташована на узбережжі Чорного моря.</li>
            <li>Місто є адміністративним центром Одеської області.</li>
            <li>Одна з відомих пам’яток міста — Одеський оперний театр.</li>
        </ul>
    """)
def contacts(request):
    return HttpResponse("""
        <h1>Контактні телефони міських служб</h1>
        <h2>Одеса</h2>
        <ul>
            <li>Єдиний центр звернень громадян: 15-35</li>
            <li>Телефон центру: (048) 705-55-55</li>
            <li>Пожежна охорона та рятувальники: 101</li>
        </ul>
    """)